{
  "title": "Civil Engineer",
  "description": "**Job Title:** Civil Engineer (Structural Engineer)\n**Company:** Deutsche Post DHL Group\n\n### **About the Role**\nJoin the Deutsche Post DHL Group as a Structural Engineer and play a pivotal role in shaping the physical infrastructure that supports our global logistics network. You will be responsible for the design, analysis, and integrity of our building and infrastructure projects, ensuring they meet the highest standards of safety and efficiency. This is an exciting opportunity to apply your expertise to complex challenges within a world-leading organization.\n\n### **Key Responsibilities**\n*   Design and analyze structural components and systems for a variety of building and infrastructure projects.\n*   Conduct detailed structural analysis and calculations to ensure the safety, stability, and durability of all designs.\n*   Ensure all structural designs and modifications are in strict compliance with local, national, and international building codes and engineering standards.\n*   Collaborate effectively with architects, project managers, and construction contractors to integrate structural elements seamlessly into overall project plans.\n*   Prepare and review technical drawings, specifications, and reports for project stakeholders.\n*   Perform structural integrity assessments on existing facilities and recommend necessary repairs or reinforcements.\n\n### **Required Qualifications**\n*   **Experience:** 1 to 15 years of professional experience in structural engineering.\n*   **Education:** Bachelor of Technology (B.Tech) in Civil Engineering or a closely related discipline.\n\n### **Required Skills**\n*   In-depth knowledge of structural engineering principles.\n*   Proficiency in structural analysis and design software (e.g., AutoCAD, SAP2000).\n*   Thorough understanding of relevant building codes and standards.\n*   Strong project management and organizational skills.\n*   Experience with structural integrity assessment.\n*   Excellent communication and collaboration abilities.\n\n### **Compensation & Benefits**\n*   **Salary Range:** $62,000 - $126,000 per year, commensurate with experience.\n*   **Benefits:**\n    *   Flexible Spending Accounts (FSAs)\n    *   Relocation Assistance\n    *   Legal Assistance\n    *   Employee Recognition Programs\n    *   Financial Counseling\n\n### **Location & Work Arrangement**\n*   **Location:** Paris, France\n*   **Work Type:** Contract"
}
