{
  "title": "Data Engineer",
  "description": "**Job Title:** Data Engineer\n**Company:** Mutual of Omaha Insurance\n**Role:** Big Data Engineer\n\n### **About the Role**\nMutual of Omaha Insurance is seeking a skilled Big Data Engineer to develop and manage our large-scale data solutions. In this role, you will be instrumental in transforming vast, complex datasets into valuable insights that drive critical business decisions. This is an opportunity to work with cutting-edge technologies and make a significant impact on our data infrastructure.\n\n### **Key Responsibilities**\n*   Design, build, and maintain scalable and reliable big data pipelines using technologies such as Hadoop and Spark.\n*   Develop and manage robust big data solutions, including data storage, processing, and analysis platforms.\n*   Process and analyze large, complex datasets to extract meaningful information and support data-driven initiatives.\n*   Optimize data processing workflows and storage systems for maximum performance, efficiency, and scalability.\n*   Collaborate with data scientists, analysts, and other stakeholders to understand data requirements and deliver effective solutions.\n*   Ensure data quality and integrity across all big data systems.\n\n### **Required Qualifications**\n*   **Experience:** 2 to 10 years of professional experience in a data engineering or a similar role.\n*   **Education:** Master of Technology (M.Tech) or an equivalent advanced degree in Computer Science, Engineering, or a related field.\n\n### **Required Skills**\n*   **Technical Skills:**\n    *   Proficiency in big data technologies, including Hadoop, Spark, HDFS, and MapReduce.\n    *   Strong experience in data processing, ETL development, and data analysis.\n    *   Solid understanding of distributed computing principles and architectures.\n    *   Experience with data warehousing solutions and database technologies (SQL, NoSQL).\n    *   Proficiency in programming languages such as Python, Java, or Scala.\n*   **Soft Skills:**\n    *   Strong analytical and problem-solving abilities.\n    *   Excellent communication and collaboration skills.\n\n### **Compensation & Benefits**\n*   **Salary Range:** $63,000 - $111,000 USD per year, commensurate with experience.\n*   **Benefits:** We offer a competitive benefits package, including:\n    *   Employee Assistance Programs (EAP)\n    *   Tuition Reimbursement\n    *   Profit-Sharing\n    *   Transportation Benefits\n    *   Parental Leave\n\n### **Location & Work Arrangement**\n*   **Location:** Juba, South Sudan\n*   **Work Type:** Contract"
}
