{
    "title": "Digital Marketing Specialist",
    "description": "**Job Title:** Digital Marketing Specialist (Email Marketing)\n**Company:** Rank Group\n\n### **About the Role**\nRank Group is seeking a creative and data-driven Email Marketing Specialist to join our dynamic marketing team. In this role, you will be responsible for designing and executing our email marketing strategy, creating compelling campaigns that engage our subscribers and drive business growth. You will play a key part in shaping our customer communication and achieving our core marketing objectives.\n\n### **Key Responsibilities**\n*   Plan, develop, and execute end-to-end email marketing campaigns, including newsletters, promotional offers, and automated lifecycle emails.\n*   Create engaging, high-quality email content and visually appealing designs that align with our brand voice and standards.\n*   Develop and manage audience segmentation strategies to ensure targeted, personalized, and relevant communication for different subscriber groups.\n*   Conduct rigorous A/B testing on subject lines, content, CTAs, and send times to continuously optimize campaign performance.\n*   Monitor, analyze, and report on key email performance metrics, including open rates, click-through rates, conversion rates, and list growth.\n*   Ensure all email campaigns comply with industry best practices and legal regulations such as GDPR and CAN-SPAM.\n\n### **Required Qualifications**\n*   **Experience:** 0 to 9 years of experience in a digital marketing or dedicated email marketing role.\n*   **Education:** Bachelor of Commerce (B.Com) or a related field.\n\n### **Required Skills**\n*   Proficiency with major email marketing platforms (e.g., Mailchimp, Constant Contact).\n*   Demonstrated experience in email campaign creation, from initial concept to final execution.\n*   Strong understanding of audience segmentation and personalization techniques.\n*   Proven ability to conduct A/B testing and implement data-driven optimizations.\n*   Knowledge of email deliverability best practices, list hygiene, and compliance standards.\n*   Excellent analytical skills with experience in tracking, interpreting, and reporting on performance metrics.\n\n### **Compensation & Benefits**\n*   **Salary Range:** $58,000 - $85,000 USD per year.\n*   **Benefits:**\n    *   Childcare Assistance\n    *   Paid Time Off (PTO)\n    *   Relocation Assistance\n    *   Flexible Work Arrangements\n    *   Professional Development Opportunities\n\n### **Location & Work Arrangement**\n*   **Location:** Warsaw, Poland\n*   **Work Type:** Contract"
}