{
  "title": "Front-End Engineer",
  "description": "**Job Title:** Front-End Engineer (UI/UX Intern)\n**Company:** Bath & Body Works\n\n### **About the Role**\nBath & Body Works is seeking a creative and detail-oriented Front-End Engineer Intern to join our dynamic team. In this role, you will focus on creating user-friendly and visually appealing interfaces, translating design concepts into functional, responsive web applications that optimize the user experience and interaction.\n\n### **Key Responsibilities**\n* Translate UI/UX design wireframes and mockups into clean, efficient, and responsive code for our web platforms.\n* Design and develop user-centric interfaces, ensuring a seamless and intuitive user journey from start to finish.\n* Conduct comprehensive usability testing and gather user feedback to iterate on and continuously improve interface designs.\n* Collaborate closely with product managers, designers, and other engineers to implement innovative solutions for product direction, visuals, and experience.\n* Ensure all front-end development adheres to modern web accessibility standards (WCAG) and best practices.\n* Create and maintain interactive prototypes and style guides to ensure consistency across all digital products.\n\n### **Required Qualifications**\n* **Experience:** 1 to 12 years of relevant experience in front-end development or UI/UX design.\n* **Education:** Bachelor of Business Administration (BBA) or a related field.\n\n### **Required Skills**\n* Proficiency in UI/UX design principles and best practices.\n* Strong experience in frontend web development, including HTML, CSS, and JavaScript.\n* Demonstrated ability with wireframing and prototyping tools (e.g., Figma, Sketch, Adobe XD).\n* Experience with user research and usability testing methodologies.\n* In-depth knowledge of web accessibility standards (WCAG).\n* Expertise in implementing responsive and adaptive design.\n* Excellent collaboration and communication skills.\n\n### **Compensation & Benefits**\n* **Salary Range:** $59,000 - $87,000 USD Annually\n* **Benefits:** Employee Referral Programs, Financial Counseling, Health and Wellness Facilities, Casual Dress Code, Flexible Spending Accounts (FSAs)\n\n### **Location & Work Arrangement**\n* **Location:** Yamoussoukro, Cote d'Ivoire\n* **Work Type:** Intern"
}
