{
  "title": "Graphic Designer",
  "description": "**Job Title:** Graphic Designer (UI/UX Designer)\n**Company:** Performance Food Group\n\n### **About the Role**\nPerformance Food Group is seeking a creative and detail-oriented UI/UX Designer to join our team on a contract basis. In this role, you will be responsible for creating intuitive, user-friendly, and visually appealing interfaces for our digital products, including websites and applications. You will play a pivotal part in shaping our user experience, ensuring a seamless and engaging journey for our customers from concept to launch.\n\n### **Key Responsibilities**\n*   Design and deliver wireframes, user stories, user journeys, and mockups optimized for a wide range of devices and interfaces.\n*   Conduct comprehensive user research and evaluate user feedback to enhance and polish the user experience.\n*   Perform usability testing to identify and troubleshoot UX problems, such as responsiveness, navigation, and accessibility issues.\n*   Collaborate closely with product managers and developers to implement innovative solutions for the product direction, visuals, and experience.\n*   Create and maintain design systems and style guides to ensure brand consistency across all digital platforms.\n*   Translate complex concepts into simple, elegant, and user-centric design solutions.\n\n### **Required Qualifications**\n*   **Experience:** 3 to 11 years of professional experience in a UI/UX design role.\n*   **Education:** Master of Commerce (M.Com) or a related field.\n\n### **Required Skills**\n*   Proficiency in User Interface (UI) and User Experience (UX) design principles.\n*   Expertise with wireframing and prototyping tools (e.g., Sketch, Figma, Adobe XD).\n*   Demonstrated experience in conducting usability testing and gathering user feedback.\n*   Strong understanding of information architecture and interaction design.\n*   In-depth knowledge of mobile-first and responsive design principles.\n*   Excellent visual design skills with a keen eye for detail.\n*   Strong communication and collaboration skills to work effectively with cross-functional teams.\n\n### **Compensation & Benefits**\n*   **Salary Range:** $61,000 - $126,000 annually, commensurate with experience.\n*   **Benefits:**\n    *   Legal Assistance\n    *   Bonuses and Incentive Programs\n    *   Wellness Programs\n    *   Employee Discounts\n    *   Retirement Plans\n\n### **Location & Work Arrangement**\n*   **Location:** Port Moresby, Papua New Guinea\n*   **Work Type:** Contract"
}
