{
  "title": "Human Resources Manager",
  "description": "**About the Role**\n\nNew Oriental Education & Technology Group is seeking a dynamic and versatile Human Resources Manager to join our team in Baghdad. In this HR Generalist role, you will be a cornerstone of our operations, responsible for managing the full spectrum of HR functions and fostering a positive, productive workplace culture. You will serve as a key strategic partner to both employees and leadership, ensuring our HR practices align with organizational goals and legal standards.\n\n**Key Responsibilities**\n\n*   Manage the end-to-end recruitment and onboarding process to attract, hire, and retain top-tier talent.\n*   Develop, implement, and maintain comprehensive HR policies and procedures, ensuring compliance with local labor laws and regulations.\n*   Serve as the primary point of contact for employee relations, expertly handling inquiries, concerns, and conflict resolution with professionalism and confidentiality.\n*   Administer employee compensation, benefits programs, and performance management systems to support employee growth and retention.\n*   Maintain accurate and confidential employee records and manage HR documentation.\n*   Champion employee engagement initiatives to cultivate a positive and collaborative work environment.\n\n**Required Qualifications**\n\n*   **Experience:** 0 to 14 years of experience in a Human Resources capacity. We encourage candidates at all levels, from recent graduates to seasoned professionals, to apply.\n*   **Education:** A Master of Commerce (M.Com) degree is required.\n\n**Required Skills**\n\n*   In-depth knowledge of core HR policies and procedures.\n*   Proven experience in managing employee relations and conflict resolution.\n*   Strong background in full-cycle recruitment and talent acquisition.\n*   Excellent verbal and written communication and interpersonal skills.\n\n**Compensation & Benefits**\n\n*   **Salary Range:** $59,000 - $90,000 USD per annum, commensurate with experience.\n*   **Benefits:**\n    *   Transportation Benefits\n    *   Professional Development Opportunities\n    *   Bonuses and Incentive Programs\n    *   Profit-Sharing\n    *   Employee Discounts\n\n**Location & Work Arrangement**\n\n*   **Location:** City of Baghdad, Iraq\n*   **Work Arrangement:** Full-Time, On-site"
}
