{
    "title": "IT Manager",
    "description": "**Job Title:** IT Manager (Infrastructure)\n**Company:** Workspace Group\n\n**About the Role**\nWorkspace Group is seeking an experienced and proactive IT Infrastructure Manager to oversee the core of our technology operations. In this critical temporary role, you will be responsible for the design, implementation, and maintenance of our entire IT infrastructure, ensuring its stability, security, and scalability to support our business goals.\n\n**Key Responsibilities**\n*   Oversee the daily operations and maintenance of the company's IT infrastructure, including servers, networks, storage solutions, and data centers.\n*   Ensure the high availability, security, and performance of all critical IT systems and services through proactive monitoring and management.\n*   Plan, coordinate, and execute technology upgrades, system migrations, and infrastructure enhancement projects from conception to completion.\n*   Develop, implement, and test disaster recovery plans and IT security policies to safeguard company data and ensure business continuity.\n*   Monitor system performance, troubleshoot complex issues, and perform regular capacity planning to meet future growth and demands.\n*   Manage relationships with technology vendors, service providers, and contractors to ensure optimal service delivery and cost-effectiveness.\n\n**Required Qualifications**\n*   **Experience:** 4 to 8 years of hands-on experience in IT infrastructure management, network administration, or a similar senior technical role.\n*   **Education:** Bachelor's Degree (BA) in Information Technology, Computer Science, or a related field.\n\n**Required Skills**\n*   Network Administration\n*   System Administration (Windows/Linux)\n*   Virtualization Technologies (e.g., VMware, Hyper-V)\n*   Storage Management (SAN, NAS)\n*   IT Security Principles and Practices\n*   Disaster Recovery Planning\n*   Capacity Planning\n*   System Monitoring and Troubleshooting\n*   Cloud Infrastructure Management (e.g., AWS, Azure)\n*   Vendor Management\n\n**Compensation & Benefits**\n*   **Salary Range:** $56,000 - $123,000 per year, commensurate with experience.\n*   **Benefits:**\n    *   Flexible Spending Accounts (FSAs)\n    *   Relocation Assistance\n    *   Legal Assistance\n    *   Employee Recognition Programs\n    *   Financial Counseling\n\n**Location & Work Arrangement**\n*   **Location:** San Marino, San Marino\n*   **Work Type:** Temporary, on-site position."
}