{
  "title": "Network Analyst",
  "description": "**Job Title:** Network Analyst (Network Performance)\n**Company:** Andersons\n**Location:** Kinshasa, Democratic Republic Of Congo\n\n### **About the Role**\nAndersons is seeking an experienced and analytical Network Performance Analyst to join our team in Kinshasa. In this critical part-time role, you will be responsible for monitoring, analyzing, and optimizing our network infrastructure to ensure peak performance, reliability, and efficiency. You will play a key role in identifying and resolving complex network issues to support our operational excellence.\n\n### **Key Responsibilities**\n*   Proactively monitor and analyze network performance data to identify trends, anomalies, and potential issues.\n*   Diagnose and troubleshoot complex network problems, including identifying performance bottlenecks, latency, and packet loss.\n*   Develop and recommend strategies for network optimization, including configuration changes and hardware upgrades.\n*   Collaborate closely with network engineering teams to implement performance improvements and validate their effectiveness.\n*   Conduct regular capacity planning and performance forecasting to support business growth and evolving network demands.\n*   Generate detailed performance reports and dashboards for technical teams and management, providing actionable insights.\n\n### **Required Qualifications**\n*   **Experience:** 5 to 14 years of professional experience in network performance analysis, network engineering, or a related field.\n*   **Education:** Master of Technology (M.Tech) or an equivalent advanced degree in a relevant technical discipline.\n\n### **Required Skills**\n*   In-depth knowledge of network performance analysis and monitoring methodologies.\n*   Hands-on experience with network monitoring tools (e.g., Wireshark, SolarWinds, Nagios).\n*   Strong troubleshooting and problem-solving skills for complex network issues.\n*   Expertise in network capacity planning and performance forecasting.\n*   Advanced data analysis skills to interpret network metrics, logs, and packet captures.\n*   Deep understanding of core network protocols (TCP/IP, BGP, OSPF, DNS, DHCP).\n\n### **Compensation & Benefits**\n*   **Salary Range:** $55,000 - $90,000 USD per year (pro-rated for part-time).\n*   **Benefits:**\n    *   Flexible Spending Accounts (FSAs)\n    *   Relocation Assistance\n    *   Legal Assistance\n    *   Employee Recognition Programs\n    *   Financial Counseling\n\n### **Location & Work Arrangement**\n*   **Location:** Kinshasa, Democratic Republic Of Congo\n*   **Work Type:** This is an on-site, Part-Time position."
}
