{
    "title": "Product Manager",
    "description": "**Job Title:** Product Manager (Agile Product Owner)\n**Company:** Gap\n\n### **About the Role**\nGap is seeking a dynamic and experienced Product Manager to join our team as an Agile Product Owner in Tegucigalpa. In this pivotal role, you will be the voice of the customer, driving the product vision and ensuring our development teams deliver exceptional value. You will be instrumental in shaping the future of our products by translating business strategy into actionable development plans.\n\n### **Key Responsibilities**\n*   Act as the primary Product Owner within an Agile development team, making critical decisions to guide product development and achieve strategic goals.\n*   Develop, maintain, and prioritize the product backlog, ensuring it is transparent, visible, and understood by all stakeholders.\n*   Translate product strategy into detailed requirements and user stories, complete with clear acceptance criteria.\n*   Serve as the key liaison between stakeholders, including business units, and the development team to ensure alignment and clear communication.\n*   Collaborate closely with Scrum or Kanban teams to plan sprints, refine backlog items, and ensure the delivered product increments meet customer needs and project objectives.\n*   Define and articulate the product vision, strategy, and roadmap, ensuring it aligns with the company's broader objectives.\n\n### **Required Qualifications**\n*   **Experience:** 2 to 13 years of experience in product management or a related role.\n*   **Education:** Bachelor of Computer Applications (BCA) or equivalent degree.\n\n### **Required Skills**\n*   Proven experience in Agile product development methodologies.\n*   Deep understanding of Scrum and/or Kanban frameworks.\n*   Expertise in product backlog management and refinement.\n*   Proficiency in writing clear and concise user stories.\n*   Strong command of various prioritization techniques.\n*   Excellent collaboration and communication skills for working with cross-functional development teams.\n*   Ability to define and communicate a clear product vision and strategy.\n\n### **Compensation & Benefits**\n*   **Salary Range:** $55,000 - $117,000 annually.\n*   **Benefits:**\n    *   Health Insurance\n    *   Life and Disability Insurance\n    *   Stock Options or Equity Grants\n    *   Employee Recognition Programs\n    *   Social and Recreational Activities\n\n### **Location & Work Arrangement**\n*   **Location:** Tegucigalpa, Honduras\n*   **Work Type:** Temporary"
}