{
    "title": "Social Worker",
    "description": "**Job Title:** Social Worker - Mental Health Counselor\n**Company:** Nationwide\n**Location:** Gibraltar, Gibraltar\n\n### **About the Role**\nNationwide is seeking a compassionate and skilled Social Worker to join our team as a Mental Health Counselor on a temporary basis. In this vital role, you will provide essential counseling and therapy services, empowering individuals and groups to navigate their mental health challenges and improve their overall well-being.\n\n### **Key Responsibilities**\n*   Conduct comprehensive mental health assessments to accurately diagnose psychological, behavioral, and emotional disorders.\n*   Develop, implement, and regularly review individualized, evidence-based treatment plans in collaboration with clients.\n*   Provide professional mental health counseling and psychotherapy to individuals and groups using a variety of therapeutic modalities.\n*   Offer immediate crisis intervention and support to clients experiencing acute psychological distress.\n*   Maintain accurate, timely, and confidential clinical documentation in accordance with ethical standards and legal requirements.\n*   Collaborate with other healthcare professionals and community resources to ensure comprehensive and coordinated client care.\n\n### **Required Qualifications**\n*   **Experience:** 3 to 14 years of professional experience in mental health counseling, psychotherapy, or a related social work field.\n*   **Education:** Master of Technology (M.Tech) degree.\n*   **Licensure:** Must hold a valid and current professional license or certification to practice in the relevant jurisdiction.\n\n### **Required Skills**\n*   Proficiency in a range of counseling techniques and psychotherapy models.\n*   Strong competency in mental health assessment and diagnostic formulation.\n*   Expertise in clinical treatment planning and progress monitoring.\n*   Advanced skills in crisis intervention and de-escalation.\n*   In-depth knowledge of and adherence to professional ethical standards.\n*   Exceptional empathy, active listening, and interpersonal abilities.\n*   Demonstrated cultural competence and sensitivity to diverse populations.\n*   Meticulous documentation and record-keeping skills.\n*   Excellent verbal and written communication skills.\n*   Commitment to professional self-care practices.\n\n### **Compensation & Benefits**\n*   **Salary Range:** $55,000 - $112,000 annually, commensurate with experience.\n*   **Benefits:**\n    *   Casual Dress Code\n    *   Social and Recreational Activities\n    *   Employee Referral Programs\n    *   Health and Wellness Facilities\n    *   Life and Disability Insurance\n\n### **Location & Work Arrangement**\n*   **Location:** Gibraltar, Gibraltar\n*   **Work Type:** This is a temporary, on-site position."
}