{
  "title": "Software Tester",
  "description": "**Job Title:** Software Tester (Automation)\n**Company:** Melrose Industries\n\n**About the Role**\nJoin Melrose Industries as an Automation Tester and play a pivotal role in our quality assurance process. You will be responsible for designing, developing, and executing automated tests to ensure our software applications meet the highest standards of functionality and performance. This is an exciting opportunity to contribute to innovative projects and drive continuous improvement in our testing methodologies.\n\n**Key Responsibilities**\n- Design, develop, and implement robust, scalable, and maintainable test automation frameworks.\n- Create and execute comprehensive automated test scripts for functional, regression, and performance testing.\n- Analyze and report on test results, identify and track defects, and provide detailed feedback to development teams.\n- Collaborate with developers, product managers, and other stakeholders to understand requirements and ensure complete test coverage.\n- Contribute to the continuous improvement of the QA process by evaluating and implementing new testing tools and technologies.\n- Manage and prepare the test data required for automated test execution.\n\n**Required Qualifications**\n- **Experience:** 0 to 9 years of experience in software quality assurance and test automation.\n- **Education:** Master of Commerce (M.Com) or an equivalent degree.\n\n**Required Skills**\n- Proficiency with test automation tools such as Selenium, Appium, or similar.\n- Strong scripting skills in languages like Python or Java.\n- Experience in developing and maintaining test automation frameworks.\n- Familiarity with Continuous Integration/Continuous Deployment (CI/CD) tools (e.g., Jenkins, GitLab CI).\n- Solid understanding of test data management strategies and tools.\n- Excellent analytical and problem-solving skills with a keen attention to detail.\n\n**Compensation & Benefits**\n- **Salary:** Annual salary range of $65,000 - $109,000 USD, commensurate with experience.\n- **Benefits:**\n    - Health Insurance\n    - Retirement Plans\n    - Paid Time Off (PTO)\n    - Flexible Work Arrangements\n    - Employee Assistance Programs (EAP)\n\n**Location & Work Arrangement**\n- **Location:** Phnom Penh, Cambodia\n- **Work Type:** This is a temporary, on-site position."
}
